<h1><center> Data Analysis: Introduction to Pandas </center></h1>

<h2> Part I. Filtering and Sorting Data </h2>

<i>Example 1. Import the necessary libraries</i>

In [1]:
import pandas as pd

<i>Example 2. Import the dataset from the local file </i>

In [ ]:
order_list = pd.read_csv('./order_list.csv', sep = '\t')
order_list.head()

id             4622
quantity       4622
food           4622
description    3376
unit_price     4622
dtype: int64

<b>Exercise 1. Display the first 5 orders of the dataset.</b>

In [4]:
order_list.head()

,id,quantity,food,description,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

<b>Exercise 2. How many order records in the dataset?</b>

In [6]:
order_list.shape[0]

4622

<b>Exercise 3. How many attributes in this dataset? </b>

In [8]:
order_list.shape[1]

5

<b>Exercise 4. What information do we have from the dataset?</b>

In [9]:
order_list.columns

Index(['id', 'quantity', 'food', 'description', 'unit_price'], dtype='object')

<b>Exercise 5. How many orders in total?

In [13]:
order_list['id'].nunique()

1834

<b>Exercise 6. Calculate the total income in this dataset.</b>

In [14]:
#Convert unit price to float (No $)
prices = []
for value in order_list.unit_price:
    value_f = float(value[1: -1])
    prices.append(value_f)
order_list.unit_price = prices
order_list.head()

,id,quantity,food,description,unit_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [16]:
order_list['total_price'] = order_list['unit_price'] * order_list['quantity']
order_list['total_price'].sum()

39237.02

<b>Exercise 7. Find the average income for each order?</b>

In [22]:
avg = ( order_list[['id', 'total_price']].groupby('id', as_index=False)
       .agg(total_by_order = ('total_price', 'sum'))
      )

avg['total_by_order'].mean()

21.39423118865867

<b>Exercise 8. How many different foods are ordered?</b>

In [23]:
order_list['food'].nunique()

50

<b>Exercise 9. Display the food which has the highest total quantity sold, and its quantity.</b>

In [33]:
highest_quantity = (order_list[['food','quantity']].groupby('food', as_index=False)
                    .agg(total_quantity = ('quantity', 'sum'))
                    .sort_values('total_quantity', ascending=False)
    
)

highest_quantity.head(10)

                            food  total_quantity
17                  Chicken Bowl             761
18               Chicken Burrito             591
25           Chips and Guacamole             506
39                 Steak Burrito             386
10             Canned Soft Drink             351
23                         Chips             230
38                    Steak Bowl             221
6                  Bottled Water             211
24  Chips and Fresh Tomato Salsa             130
9                    Canned Soda             126

<b>Exercise 10. What is the most frequently ordered food item?</b>

In [34]:
most_frequent = (order_list[['food', 'id']].groupby('food', as_index=False)
                 .agg(count_id = ('id','count'))
                 .sort_values('count_id', ascending=False)
)

most_frequent.head(10)

                   food  count_id
17         Chicken Bowl       726
18      Chicken Burrito       553
25  Chips and Guacamole       479
39        Steak Burrito       368
10    Canned Soft Drink       301
38           Steak Bowl       211
23                Chips       211
6         Bottled Water       162
22   Chicken Soft Tacos       115
21   Chicken Salad Bowl       110